Repository: common-repository/aldnburg-inline-weather-shortcodes
Catalog: languages/aiws-weather-*.po
Languages: de_de

source: The OpenWeatherMap API requires a citycode to find the exact city you want to get the data from. To find the citycode, simply go to <a href="http://www.openweathermap.org" target="_blank">www.openweathermap.org</a> and search for your city. Open the site and have a look at the URL, for example:<br><code>http://openweathermap.org/city/2857458</code>. The number at the end of the URL is the citycode.
de_de: Die OpenWeatherMap-API ben&ouml;tigt einen Citycode, um die exakte Temperatur der Stadt zu finden, die du haben m&ouml;chtest. Um diesen Citycode zu finden, gehe einfach auf <a href="http://www.openweathermap.org" target="_blank">www.openweathermap.org</a> und suche nach der Stadt. &Ouml;ffne die Ergebnisseite und schau dir die URL genau an, zum Beispiel:<br><code>http://openweathermap.org/city/2857458</code>. Die Nummer am Ende ist der Citycode.

source: Some plans might require to mention the service on your blog.
de_de: Einige Abonnements k&ouml;nnten eine Erw&auml;hnung auf dem Blog verlangen.

source: Simply place the shortcode <code>[temp]</code> wherever you want to display the current temperature of your default city. Thats all!
de_de: Gib einfach den Shortcode <code>[temp]</code> da ein, wo du die aktuelle Temperatur der Standard-Stadt anzeigen m&ouml;chtest. Das war's!

source: However, the most common use is to display the current temperature of a certain city by using an optional parameter. Simply put <code>[temp citycode="xxxxxxx"]</code> wherever you want, to get the temperature from the city you want.
de_de: Die gebr&auml;uchlichste Weise ist, die aktuelle Temperatur einer bestimmten Stadt mit Hilfe des optionalen Parameters auszugeben . F&uuml;ge einfach <code>[temp citycode="xxxxxxx"]</code> ein, wo immer du m&ouml;chtest, um die Temperatur einer bestimmte Stadt auszugeben.

source: If you omit <code>citycode="xxxxxxx"</code> the default citycode is used.
de_de: Wenn du <code>citycode="xxxxxxx"</code> wegl&auml;sst, wird die Standard-Stadt verwendet.

source: [error 870]
de_de: [Fehler 870]

source: [error 872]
de_de: [Fehler 872]

source: [error 877]
de_de: [Fehler 877]

source: Display wheather data (currently: temperature) for the current date or a forecast (up to five days) from openweathermap.org.
de_de: Zeige Wetterdaten (zur Zeit: Temperatur) f&uuml;r den aktuellen Tag oder eine Vorhersage (bis zu 5 Tage) von openweathermap.org.

source: MRDN Weather Settings
de_de: MRDN Weather Einstellungen

source: Account Settings
de_de: Account Einstellungen

source: Your API Key
de_de: Dein API-Key

source: Choose the unit
de_de: W&auml;hle das System

source: Display unit symbol?
de_de: Zeige Einheitensymbol?

source: Code for default city
de_de: Code f√ºr die Standard-Stadt

source: Get your API-Key on
de_de: Hole dir den API-Key auf

source: Metric
de_de: Metrisch

source: Yes
de_de: Ja

source: No
de_de: Nein

source: This city is used, if you omit the optional parameter "citycode" in your shortcode. Useful for repeating weather data of one specific city throughout the blog.
de_de: Diese Stadt wird benutzt, wenn du im Shortcode den optionalen Parameter "citycode" wegl&auml;sst. Das ist n&uuml;tzlich, wenn eine bestimmte Stadt an mehreren Stellen im Blog verwendet werden soll.

source: No API-Key set.
de_de: Kein API-Key gesetzt.

source: Error trying to connect to the server.
de_de: Fehler beim Verbindungsversuch zum Server.

source: This API-Key is valid.
de_de: Dieser API-Key ist g&uuml;tig.

source: City not found.
de_de: Stadt konnte nicht gefunden werden.

source: This API-Key is not valid.
de_de: Dieser API-Key ist ung&uuml;tig.

source: Unknown error.
de_de: Unbekannter Fehler.

source: Quick help
de_de: Schnellhilfe

source: Getting started
de_de: Start

source: The OpenWeatherMap API requires an API-Key. They offer different plans (and even a free one) for which you can sign up. Simply go to
de_de: Die OpenWeatherMap-API verlangt einen API-Key. Melde dich f&uuml;r eines der Abonnements an (es gibt auch einen kostenlosen Account). Gehe dazu einfach auf

source: There will be an easier way to access the citycode via this plugin in future, stay tuned!
de_de: Es wird in Zukunft einen einfacheren Weg geben, um den Citycode herauszufinden. Wir informieren euch!

source: Licensing
de_de: Lizenz

source: Read the licensing information carefully on
de_de: Lies die Lizenz-Informationen auf

source: Current Temperature
de_de: Aktuelle Temperatur

source: Temperature forecast
de_de: Temperatur Vorhersage

source: To display a temperature forecast for up to five days use <code>[tempDay day="x" citycode="xxxxxxx"]</code> shortcode. Both parameters are optional, if you omit <code>day="x"</code>, the shortcode will return temperature of the current day. Possible values are <code>0 - 5</code>.
de_de: Um eine Temperaturvorhersage f&uuml;r bis zu 5 Tage anzuzeigen, nutze den <code>[tempDay day="x" citycode="xxxxxxx"]</code> shortcode. Beide Parameter sind optional, wenn du <code>day="x"</code> wegl&auml;sst, wird die Temperatur des aktuellen Tags ausgegeben. M&ouml;gliche Werte sind <code>0 - 5</code>.

source: Other Shortcodes
de_de: Weitere Shortcodes

source: More options and other shortcodes will be added permanently!
de_de: Weitere Optionen und Shortcodes werden laufend erg&auml;nzt!
